Revit 2027 API
CircuitConnectionType Enumeration
 An enumerated type indicates the panel to panel connection type
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CircuitConnectionType
Public Enumeration CircuitConnectionType
public enum class CircuitConnectionType
type CircuitConnectionType
Members
Member name | Value | Description
Breaker | 1 |  Breaker.
FeedThruLugs | 2 |  FeedThruLugs.
NotApplicable | 0 |  NotApplicable.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace